{
  "es": {
    "language_name": "English",
    "home": "Inicio",
    "about": "Sobre mi",
    "portfolio": "Portfolio",
    "contact": "Contacto",
    "developer": "Desarrollador de Videojuegos en Unity",
    "Cert": "Certificados",
    "home-text": "Técnico en programación y diseño de videojuegos graduado en la Universidad Nacional del Litoral. Actualmente desarrollando proyectos freelance y en busca de un empleo fijo como desarrollador de videojuegos",
    "uni": "Universidad",
    "exp": "Experiencia",
    "edu": "Educación",
    "tecnico": "Tecnicatura en diseño y programación de videojuegos. En la Universidad Nacional del Litoral. Facultad de Ingeniería y Ciencias Hídricas. (Completo).",
    "curso": "Curso",
    "curso-pixi": "Curso ''Desarrollo en entorno PIXI.JS para industrias Audiovisuales, Videojuegos y Desarrollo Web''. Curso dado por The Rabbit Hole. (Completo)",
    "freelance-text": "Trabajo como programador y diseñador de video juegos para Angry Cat Games, desarrollando videojuegos para Legends of Learning utilizando Unity.",
    "more": "Mas",
    "play": "Jugar",
    "farmday-desc": "Educativo con Minijuegos 2D",
    "sfr-desc": "Endless Runner 2D de Plataformas",
    "farm-modal-1": "Farm Day es un videojuego educativo que desarrollé trabajando para Angry Cat Games para la empresa Legend Of Learning. El juego consiste en resolver minijuegos y acertijos con el objetivo de aprender conceptos sobre química y física.",
    "farm-modal-2": "El proyecto fue desarrollado íntegramente con Unity, los scripts están programados en C# y se utilizaron archivos json para gestionar la carga de diferentes lenguajes.",
    "farm-modal-3": "Algunos de los minijuegos consisten en talar un árbol sin que los troncos golpeen al granjero, colocar ingredientes en un bol en un orden determinado para cocinar un pastel, disponer tuberías para hacer abono y otras mecánicas.",
    "dock-modal-1": "The Endless Dock es un Endless Runner 3D, desarrollado en Unity. Es un videojuego con temática pirata donde el jugador debe tener tres carriles y debe moverse entre ellos y saltar para evitar los obstáculos que se acercan al muelle.",
    "dock-modal-2": "El juego fue creado como proyecto final de la asignatura ''Manipulación de objetos 3D'' de la carrera de diseño y programación de videojuegos.",
    "dock-modal-3": "Tanto los obstáculos como el mapa se generan a medida que el personaje llega a los límites del mapa.",
    "dock-modal-4": "Programé un sombreador que da el efecto de ''World Bending'' similar a Animal Crossing o Subway Surfer para dar el efecto de que el horizonte se curva.",
    "sfr-modal-1": "Santa Fe Runner es una plataforma 2D Endless Runner creada como proyecto final de un curso. El juego se desarrolló utilizando la biblioteca PIXI.JS durante un período de aproximadamente 3 meses. El proyecto se adapta automáticamente al dispositivo en el que se reproduce sin necesidad de configurar nada.",
    "sfr-modal-2": "El objetivo es conseguir la mayor puntuación posible evitando los obstáculos que aparecen aleatoriamente. Estos obstáculos se pueden saltar o el personaje puede tirar para pasar por debajo de ellos. Además, hay objetos coleccionables que sirven para tener otra oportunidad si chocas con un obstáculo.",
    "sfr-modal-3": "Un diario importante de la ciudad de Santa Fe que vio el Videojuego me escribió una nota que fue publicada en el diario de la ciudad",
    "sfr-modal-4": "Después de eso, me invitaron a una feria de tendencias tecnológicas en la ciudad de Santa Fe, donde alguien grabó el videojuego y lo subió a una página de Instagram, el video obtuvo más de medio millón de visitas.",
    "sfr-modal-5": "Entonces una televisora ​​me contactó para hacerme una entrevista.",
    "sfr-modal-6": "Luego me invitaron a otra feria de tecnología, donde con un amigo que es artista volvimos a hacer los activos del juego y procedí a agregar una base de datos para hacer un sistema de mejores puntuaciones.",
    "see-interview": "ver entrevista",
    "hiotw-modal-1": "Help Is On The Way es un Survival Shooter Top Down 2D creado en Godot como proyecto final para la asignatura 'Programación de videojuegos 3'. El objetivo es sobrevivir cierta cantidad de tiempo, esquivando y derrotando enemigos.",
    "hiotw-modal-2": "El juego cuenta con dos personajes jugables, un arquero y un caballero que atacara con su espada, y los enemigos constan de orcos y barriles explosivos.",
    "hiotw-modal-3": "El juego es compatible con GamePads y cuenta con un menú de configuración persistente.",
    "footer": "© Federico Eigler | Todos los derechos reservados",
    "btn-modal": "Cerrar ventana",
    "looter-desc": "Terror en primera persona",
    "looter-modal-1": "The Looter es un juego de terror en primera persona que pone a prueba la astucia y la habilidad del jugador para sobrevivir en un oscuro cementerio, mientras saquea tumbas en busca de tesoros antiguos. La historia gira en torno a un personaje que, armado con un misterioso libro de saqueos, se adentra en un cementerio prohibido para desenterrar riquezas ocultas. Sin embargo, su tarea no es tan sencilla como parece; debe lidiar con los constantes peligros de la vigilancia del cuidador y su fiel perro guardián.",
    "looter-modal-2": "El jugador deberá encontrar y cavar en tumbas específicas, guiándose por el libro de saqueos que detalla las localizaciones. A medida que avanza, se encontrará con mausoleos cerrados que contienen las llaves necesarias para abrir zonas cruciales, lo que obliga a explorar cada rincón del mapa para reunir las llaves escondidas. La experiencia de saqueo se ve intensificada por un enigma que permite el acceso a la capilla del cementerio. Un candado con un código de tres dígitos bloquea la entrada a una tumba de vital importancia. Los números de este código están dispersos por el mapa, cada uno identificado con un color correspondiente; encontrar cada pista y resolver este rompecabezas es esencial para avanzar en la historia.",
    "looter-modal-3": "El cuidador y su perro representan un peligro constante. Si el jugador se acerca demasiado, el perro ladra, alertando al cuidador, quien puede atacar al jugador si logra acercarse. Esta mecánica de sigilo, combinada con la necesidad de resolver el rompecabezas y saquear las tumbas sin ser detectado, crea una experiencia inmersiva y aterradora.",
    "pasantia-text": "Pasantia en la ''División Tecnologías de la Información'' (DTI) en la ''Facultad de Ciencias Económicas'' de la ''Universidad Nacional del Litoral'' (FCE - UNL). Donde realicé tareas de mantenimiento, instalación de software y sistemas operativos, gestión de redes, entre otras tareas.",
    "pasantia-title": "Pasantia"
  },
  "en": {
    "language_name": "Español",
    "home": "Home",
    "about": "About",
    "portfolio": "Portfolio",
    "contact": "Contact",
    "developer": "Unity Videogame Developer",
    "Cert": "Certificates",
    "home-text": "Video Game Programming and Design Technician, graduated from the Universidad Nacional del Litoral. Currently working on freelance projects and seeking a full-time position as a video game developer",
    "uni": "University",
    "exp": "Experience",
    "edu": "Education",
    "tecnico": "Technical Degree in Video Game Design and Programming. At the ''Universidad Nacional del Litoral'' at the ''Facultad de Ingeniería y Ciencias Hídricas''. (Completed).",
    "curso": "Course",
    "curso-pixi": "Course ''Development in PIXI.JS environment for industries Audiovisuals, Video Games and Web Development''. Course given by The Rabbit Hole. (Completed)",
    "freelance-text": "I work as a programmer and game designer for Angry Cat Games, developing games for Legends of Learning using Unity.",
    "more": "More",
    "play": "Play",
    "farmday-desc": "Educational with 2D Minigames",
    "sfr-desc": "Endless Runner 2D Platforms",
    "farm-modal-1": "Farm Day is an educational video game that I developed working for Angry Cat Games for the company Legend Of Learning. The game is about solving mini-games and puzzles with the aim of learning concepts about chemistry and physics.",
    "farm-modal-2": "The project was developed entirely with Unity, the scripts are programmed in C# and json files were used to manage the loading of different languages.",
    "farm-modal-3": "Some of the minigames consist of cutting down a tree without the trunks hitting the farmer, placing ingredients in a bowl in a certain order to cook a cake, arranging pipes to make compost and other mechanics.",
    "dock-modal-1": "The Endless Dock is a 3D Endless Runner, Developed in Unity. It is a video game with a pirate theme where the player must have three lanes and must move between them and jump to avoid the obstacles that approach the dock.",
    "dock-modal-2": "The game was created as the final project of the subject ''Manipulation of 3D objects'' of the ''Technical Degree in Video Game Design and Programming''.",
    "dock-modal-3": "Both the obstacles and the map are generated as the character reaches the limits of the map.",
    "dock-modal-4": "I programmed a shader that gives the effect of ''World Bending'' similar to Animal Crossing or Subway Surfer to give the effect that the horizon curves",
    "sfr-modal-1": "Santa Fe Runner is a 2D platform Endless Runner created as a final project for a course. The game was developed using the PIXI.JS library over a period of approximately 3 months. The project automatically adapts to the device it is being played on without the need to configure anything.",
    "sfr-modal-2": "The objective is to get the highest score possible by avoiding obstacles that appear randomly. These obstacles can be jumped or the character can roll to go under them. In addition, there are collectible objects that are used to get another chance if you hit an obstacle.",
    "sfr-modal-3": "An important newspaper in the city of Santa Fe that saw the Video Game wrote a note to me that was published in the city newspaper ",
    "sfr-modal-4": "After that, I was invited to a technology trends fair in the city of Santa Fe, where someone recorded the video game and posted it to an Instagram page, the video got more than half a million views.",
    "sfr-modal-5": "Then a television station contacted me to do an interview.",
    "sfr-modal-6": "Then I was invited to another technology fair, where with a friend who is an artist we went back to making the game assets and I proceeded to add a database to make a system of best scores.",
    "see-interview": "see interview",
    "hiotw-modal-1": "Help Is On The Way is a 2D Top Down Survival Shooter created in Godot as a final project for the subject 'Video Game Programming 3'. The objective is to survive a certain amount of time, avoiding and defeating enemies.",
    "hiotw-modal-2": "The game features two playable characters, an archer and a knight who attacks with his sword, and the enemies consist of orcs and explosive barrels.",
    "hiotw-modal-3": "The game supports GamePads and features a persistent settings menu.",
    "footer": "© Federico Eigler | All Rights Reserved",
    "btn-modal": "Close Window",
    "looter-desc": "Horror in first person",
    "looter-modal-1": "The Looter is a first-person horror game that challenges players to survive a night in a haunted graveyard while looting graves for ancient treasures. Armed with a mysterious book detailing specific graves to rob, the player must dig for treasures in marked locations. However, danger is ever-present, as they must evade both a vigilant groundskeeper and his alert guard dog.",
    "looter-modal-2": "As players progress, they’ll encounter locked mausoleums that require hidden keys scattered across the cemetery grounds. To access a crucial tomb in the chapel, players must solve a color-coded puzzle. A three-digit lock guards the tomb, with each digit identified by a color. These numbers are scattered across the map, adding a layer of suspense and strategy as players piece together the code while avoiding detection.",
    "looter-modal-3": "The groundskeeper and his dog constantly roam the area. If players get too close, the dog barks, alerting the groundskeeper to the player’s presence, who will strike if he gets too near. This stealth mechanic, combined with the need to solve puzzles and loot graves under pressure, creates a deeply immersive and terrifying experience.",
    "pasantia-text": "Internship in the ''División Tecnologías de la Información'' (DTI) at the ''Facultad de Ciencias Económicas'' of the ''Universidad Nacional del Litoral'' (FCE - UNL). Where I performed maintenance tasks, installation of software and operating systems, network management, among other tasks.",
    "pasantia-title": "Internship"
  }
}
